chat_system_173621352_actor_description=Scott Thompson. Governor of Islands of Freedom.
chat_system_173621352_snap_0_question=^?^Thorny Dog has a stepbrother named Mano Riveres. Maybe you even know him. His Castle Exile is situated to the north. Mano always was a good pirate, and follows the code of the Islands of Freedom. But I'm afraid that after killing his brother, Mano might do something stupid.<br>I want you to go to Mano's Castle and negotiate with him as my representative. Persuade him to swear fealty to me, and swear off revenge.<br>And if you can't do it, then the Wild Duke will; his troop of cutthroats is already headed that way. These guys ask for a lot of money for their mercenary services. But they know the job, and they're loyal to me.<br>[reward]
chat_system_173621352_snap_0_answer_0=^?^Ok, I'll speak to him, but I hope your men don't hinder me.
chat_system_173621352_snap_0_answer_1=^?^Another dirty job. I think I'll decline, and see what else the place offers. Check back with you later.
chat_system_173621352_snap_1_question=^?^Don't worry about my people. They won't engage before you have a chance to settle things, I would prefer to solve this problem peacefully. 
chat_system_173621352_snap_1_answer_0=^?^Ok, I'll solve this problem peacefully, if that's possible.
chat_system_173621352_snap_2_question=^?^Have you spoken to Mano? I hope you have explained to him that any attempt at revenge will only end in his own death.
chat_system_173621352_snap_2_answer_0=^?^No I haven't spoken to him yet.
chat_system_173621352_snap_2_answer_1=^?^Yes. Everything's fine. Mano swore fealty to you, and he has sworn off revenge. However... the duke's people got out of control, and I had to kill them.
chat_system_173621352_snap_2_answer_2=^?^I tried to persuade him, but the presence of the duke's cutthroats spoiled everything. Mano became nervous, and I ended up having to kill him.
chat_system_173621352_snap_3_question=^?^Well... the duke was a reliable man, trustworthy when a situation got dangerous. But I know he was very hot-tempered, and I am sorry that he hindered you.<br>In any case, you have earned your reward!<br>[reward]
chat_system_173621352_snap_3_answer_0=^?^Thank you, Governor, I was glad to help you!
chat_system_173621352_snap_4_question=^?^It's a pity, a real pity. Mano Riveres was a darn good pirate and a fine fellow! And I fear that Wild Duke, having won this remarkable castle, someday may even feel strong enough that he will go against me.<br>But you did a good job anyway, and you have earned the reward.<br>[reward]
chat_system_173621352_snap_4_answer_0=^?^Thank you, Governor, I was glad to help.
